package work51;

public class Task55 {
    /**
     * ЗАДАНИЕ:
     1. Откройте проект PracticalWork5 и добавьте в него пакет work55, в
     котором создайте класс Task55.
     2. Добавьте в класс Task55 метод public static void main(String[] args) { }.
     3. Добавьте в метод main(...) код, который:
     − вводит некоторую строку;
     − выводит в консоль все уникальные символы этой строки.
     4. Запустите приложение на исполнение.
     ТРЕБОВАНИЯ
     1. Приложение должно быть написано на языке Java.
     2. Используйте методы charAt(), length(), indexOf() и lastIndexOf() класса
     String и оператор цикла while для получения результата.
     3. Используйте оператор System.out.println(...) для вывода результата.
     */
    public static void main(String[] args) {

    }
}
