package CodeSpacePracticeCore.work24;

public class Task45 {

    /**ЗАДАНИЕ:
     1. Откройте проект PracticalWorkВ2-4 и добавьте в класс Runner методы:
     − отображения списка книг указанного автора;
     − отображения списка книг, выпущенных указанным издательством;
     − отображения списка книг, выпущенных после указанного года.
     2. Добавьте в код метода run() вызовы описанных методов.
     3. Запустите приложение на исполнение.
     ТРЕБОВАНИЯ
     1. Приложение должно быть написано на языке Java.
     2. Используйте класс Scanner для ввода с клавиатуры значений для отбора
     книг.*/
}
