package CodeSpacePracticeCore.work24;

public class Task43 {
    /**ПРАКТИЧЕСКАЯ РАБОТА Б2_4-3

     ЗАДАНИЕ:
     1. Откройте проект PracticalWorkВ2-4 и добавьте в класс Book несколько
     конструкторов с различным набором параметров.
     2. Измените код метода main() класса TaskB24 так, чтобы он создавал
     несколько объектов типа Book с использованием разных конструкторов и
     отображал их в консоли.
     3. Запустите приложение на исполнение.
     ТРЕБОВАНИЯ
     1. Приложение должно быть написано на языке Java.
     2. Предусмотреть конструктор по умолчанию.*/
    public static void main(String[] args) {
      //done at Task41
    }
}
