package CodeSpacePracticeCore.work24;

public class Task44 {
    /**ПРАКТИЧЕСКАЯ РАБОТА Б2_4-4

     ЗАДАНИЕ:
     1. Откройте проект PracticalWorkВ2-4 и добавьте в пакет workB24 класс
     Runner c методом run().
     2. Добавьте в класс Runner метод создания массива объектов типа Book (не
     меньше 7 книг).
     3. Добавьте в класс Runner метод вывода массива объектов типа Book.
     4. Добавьте в класс Runner метод, который уменьшает стоимость каждой
     книги массива на указанное количество процентов.
     5. Добавьте в код метода run() создание и вывод массива объектов типа Book,
     затем измените стоимость всех книг в массиве и отобразите их в консоль.
     6. Добавьте в код метода main() создание экземпляра класса Runner и вызов
     на нем метода run().
     7. Запустите приложение на исполнение.
     ТРЕБОВАНИЯ
     1. Приложение должно быть написано на языке Java.
     2. Применение класса Runner позволит использовать метод main() как
     точку входа в java-программу.
     3. Используйте класс Scanner для ввода с клавиатуры значения процента
     для изменения стоимости книг.*/

    public static void main(String[] args) {

    }
}
